tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "bat-extras"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "go"
brew "httpie"
brew "icu4c@76"
brew "jq"
brew "lazygit"
brew "libidn2"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "pkgconf"
brew "pyenv"
brew "python@3.9"
brew "rename"
brew "ripgrep"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "virtualenv"
brew "wget"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "acreom"
cask "alfred"
cask "alt-tab"
cask "firefox"
cask "ghostty"
cask "itsycal"
cask "karabiner-elements"
cask "maccy"
cask "obsidian"
cask "raycast"
cask "shottr"
