tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "bat-extras"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "fzf"
brew "gettext"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxinator"
cask "acreom"
cask "raycast"
cask "shottr"
